# def ascii1(code):

# 4172 2002 6910 7737

# 001101000011010000110101 

#  52   52   53

#  3421237

# cvv 445
"""Dary. Legendary(c) Barney Stinson Дарю кредитку с 20к сом своей аудитории. Карта зашифрована в этом сообщении

#демирпидорасы 4172 сома списали. 20 числа февраля месяца. 69 позиция опасная зона для секса)))) минус два в двоичной семьсемь. Когда плохо, то зверь кричит три секунды в аду без 11 апостолов и в конце цифра семь.
^ номер карты.

Она действует до лета эмэмххив 

Cvv не  важен  ведь 00110100  00110100 00110101, правда"""

"""
4172 2002 5977 0311

4172 2002 5977 0317

4172 2069 6703 0311

4172 2069 1077 0311

4172 2002 69 

-10 77 03


4172 2002 5977 6557

4172 2002 5977 6557

07/24
445


"""